/**
 * Sample React Native App
 * https://github.com/facebook/react-native
 * @flow
 */
import React, {Component} from "react";
import {
    AppRegistry,
    StyleSheet,
    Text,
    View,
    Image,
    NavigatorIOS,
    TabBarIOS,

} from "react-native";
import * as atb from "react-native-animatable";
import Icon from "react-native-vector-icons/MaterialIcons";
import Icon2 from 'react-native-vector-icons/FontAwesome';

import ListComponent from "./ListComponent";


var styl = require('./styles');

class bappa extends Component {
  constructor(props) {
    super(props);
    this.state = {
      user: '',
      selectedTab: 'a',
    };
  }

  render() {

    if (!this.state.user) {
      return (
          <View style={styl.containersignin}>

            <atb.Image animation="fadeIn"
                       style={styl.backdrop}
                       resizeMode='contain'
                       source={require('./logo.png')}/>
            <atb.View animation="fadeIn" duration={500}>
              <atb.Text animation="fadeInUp" style={styl.welcome} delay={500}>
                Bappa
              </atb.Text>
              <atb.Text animation="fadeInUp" style={styl.instructions} delay={500}>
                Ganpati stotra compilation
              </atb.Text>
            </atb.View>

            <atb.View animation="fadeIn" delay={2200}>
              <Icon2.Button name="sign-in" color="#38230F" borderColor="#3A4C86" backgroundColor="orange"
                            borderWidth={1} onPress={() => {
                {
                  this.setState({user: 'abc'});
                }
              }}>
                <Text style={{fontFamily: 'Arial', fontSize: 15, color: "#38230F"}}>Get Started</Text>
              </Icon2.Button>
            </atb.View>


          </View>)
    }

    if (this.state.user) {
      return (
          <TabBarIOS
              unselectedTintColor="grey"
              tintColor="#3A4C86"
              barTintColor="white">
            <Icon.TabBarItemIOS
                title="अथर्वशीर्षम्"
                iconName="home"
                iconColor="grey"
                selectedIconName="home"
                selectedIconColor="#3A4C86"
                renderAsOriginal={true}
                selected={this.state.selectedTab === 'a'}
                onPress={() => {
                  this.setState({
                    selectedTab: 'a',
                  });
                }}>
              <NavigatorIOS
                  barTintColor='#EAA22F'
                  style={styl.container}
                  initialRoute={{title: 'अथर्वशीर्षम्', component: ListComponent, passProps: {ds: ads}}}
              />
            </Icon.TabBarItemIOS>

            <Icon.TabBarItemIOS
                title="गणेशस्तोत्रम्"
                iconName="directions-walk"
                iconColor="grey"
                selectedIconName="directions-walk"
                selectedIconColor="#3A4C86"
                renderAsOriginal={true}
                selected={this.state.selectedTab === 'b'}
                onPress={() => {
                  this.setState({
                    selectedTab: 'b',
                  });
                }}>
              <NavigatorIOS
                  barTintColor='#EAA22F'
                  style={styl.container}
                  initialRoute={{title: 'गणेशस्तोत्रम्', component: ListComponent, passProps: {ds: bds}}}
              />
            </Icon.TabBarItemIOS>

            <Icon.TabBarItemIOS
                title="सुखकरता"
                iconName="perm-identity"
                iconColor="grey"
                selectedIconName="perm-identity"
                selectedIconColor="#3A4C86"
                renderAsOriginal={true}
                selected={this.state.selectedTab === 'c'}
                onPress={() => {
                  this.setState({
                    selectedTab: 'c',
                  });
                }}>
              <NavigatorIOS
                  barTintColor='#EAA22F'
                  style={styl.container}
                  initialRoute={{title: 'सुखकरता', component: ListComponent, passProps: {ds: cds}}}
              />
            </Icon.TabBarItemIOS>

          </TabBarIOS>


      );
    }

  }
}

var ads = ['श्रीगणपति अथर्वशीर्षम् |',
    'श्री गणेशाय नमः ।',
    '(शान्तिमन्त्राः)',
    'ॐ भद्रङ् कर्णेभिः शृणुयाम देवाः ।',
    'भद्रम् पश्येमाक्षभिर्यजत्राः ।',
    'स्थिरैरङ्गैस्तुष्टुवांसस्तनूभिः',
    'व्यशेम देवहितं यदायुः ।।',
    'ॐ स्वस्ति न इन्द्रो वृद्धश्रवाः ।',
    'स्वस्ति नः पूषा विश्ववेदाः ।',
    'स्वस्ति नस्ताक्ष्र्योऽअरिष्टनेमिः',
    'स्वस्ति नो बृहस्पतिर्दधातु ।।',
    'ॐ शान्तिः शान्तिः शान्तिः ।।',
    'ॐ नमस्ते गणपतये ।',
    'त्वमेव प्रत्यक्षन् तत्त्वमसि ।',
    'त्वमेव केवलङ् कर्ताऽसि ।',
    'त्वमेव केवलन् धर्ताऽसि ।',
    'त्वमेव केवलम् हर्ताऽसि ।',
    'त्वमेव सर्वङ् खल्विदम् ब्रह्मासि ।',
    'त्वं साक्षादात्माऽसि नित्यम् ।। १ ।।',
    'ऋतं वच्मि । सत्यं वच्मि ।। २ ।।',
    'अव त्वम् माम् । अव वक्तारम् ।',
    'अव श्रोतारम् । अव दातारम् ।',
    'अव धातारम् । अवानूचानमव शिष्यम् ।',
    'अव पश्चात्तात् । अव पुरस्तात् ।',
    'अवोत्तरात्तात् । अव दक्षिणात्तात् ।',
    'अव चोध्र्वात्तात् । अवाधरात्तात् ।',
    'सर्वतो माम् पाहि पाहि समन्तात् ।। ३ ।।',
    'त्वं वाङ्मयस्त्वञ् चिन्मयः ।',
    'त्वम् आनन्दमयस्त्वम् ब्रह्ममयः ।',
    'त्वं सच्चिदानन्दाद्वितीयोऽसि ।',
    'त्वम् प्रत्यक्षम् ब्रह्मासि ।',
    'त्वम् ज्ञानमयो विज्ञानमयोऽसि ।। ४ ।।',
    'सर्वञ् जगदिदन् त्वत्तो जायते ।',
    'सर्वञ् जगदिदन् त्वत्तस्तिष्ठति ।',
    'सर्वञ् जगदिदन् त्वयि लयमेष्यति ।',
    'सर्वञ् जगदिदन् त्वयि प्रत्येति ।',
    'त्वम् भूमिरापोऽनलोऽनिलो नभः ।',
    'त्वञ् चत्वारि वाव्पदानि ।। ५ ।।',
    'त्वङ् गुणत्रयातीतः ।',
    '(त्वम् अवस्थात्रयातीतः ।)',
    'त्वन् देहत्रयातीतः । त्वङ् कालत्रयातीतः ।',
    'त्वम् मूलाधारस्थितोऽसि नित्यम् ।',
    'त्वं शक्तित्रयात्मकः ।',
    'त्वां योगिनो ध्यायन्ति नित्यम् ।',
    'त्वम् ब्रह्मा त्वं विष्णुस्त्वम् रुद्रस्त्वम्',
    'इन्द्रस्त्वम् अग्निस्त्वं वायुस्त्वं सूर्यस्त्वञ चन्द्रमास्त्वम्',
    'ब्रह्मभूर्भुवः स्वरोम् ।। ६ ।।',
    'गणादिम् पूर्वमुच्चार्य',
    'वर्णादिन् तदनन्तरम् ।',
    'अनुस्वारः परतरः । अर्धेन्दुलसितम् ।',
    'तारेण ऋद्धम् । एतत्तव मनुस्वरूपम् ।',
    'गकारः पूर्वरूपम् । अकारो मध्यमरूपम् ।',
    'अनुस्वारश्चान्त्यरूपम् ।',
    'बिन्दुरुत्तररूपम् ।',
    'नादः सन्धानम् । संहिता सन्धिः ।',
    'सैषा गणेशविद्या । गणक ऋषिः ।',
    'निचृद्गायत्री छन्दः । गणपतिर्देवता ।',
    'ॐ गँ गणपतये नमः ।। ७ ।।',
    'एकदन्ताय विद्महे । वक्रतुण्डाय धीमहि ।',
    'तन्नो दन्तिः प्रचोदयात् ।। ८ ।।',
    'एकदन्तञ् चतुर्हस्तम्,',
    'पाशमङ्कुशधारिणम् ।',
    'रदञ् च वरदम् हस्तैर्बिभ्राणम्,',
    'मूषकध्वजम् ।',
    'रक्तं लम्बोदरं,',
    'शूर्पकर्णकम् रक्तवाससम् ।',
    'रक्तगन्धानुलिप्ताङ्गम्,',
    'रक्तपुष्पैःसुपूजितम् ।',
    'भक्तानुकम्पिनन् देवञ्,',
    'जगत्कारणमच्युतम् ।',
    'आविर्भूतञ् च सृष्ट्यादौ,',
    'प्रकृतेः पुरुषात्परम् ।',
    'एवन् ध्यायति यो नित्यं',
    'स योगी योगिनां वरः ।। ९ ।।',
    'नमो व्रातपतये, नमो गणपतये,',
    'नमः प्रमथपतये,',
    'नमस्ते अस्तु लम्बोदराय एकदन्ताय,',
    'विघ्ननाशिने शिवसुताय,',
    'वरदमूर्तये नमः ।। १० ।।',
    'एतदथर्वशीर्षं योऽधीते ।',
    'स ब्रह्मभूयाय कल्पते ।',
    'स सर्वविघ्नैर्न बाध्यते ।',
    'स सर्वतः सुखमेधते ।',
    'स पञ्चमहापापात् प्रमुच्यते ।',
    'सायमधीयानो दिवसकृतम्',
    'पापन् नाशयति ।',
    'प्रातरधीयानो रात्रिकृतम्',
    'पापन् नाशयति ।',
    'सायम् प्रातः प्रयुञ्जानोऽअपापो भवति ।',
    'सर्वत्राधीयानोऽपविघ्नो भवति ।',
    'धर्मार्थकाममोक्षञ् च विन्दति ।',
    'इदम् अथर्वशीर्षम् अशिष्याय न देयम् ।',
    'यो यदि मोहाद्दास्यति',
    'स पापीयान् भवति ।',
    'सहस्रावर्तनात् ।',
    'यं यङ् काममधीते',
    'तन् तमनेन साधयेत् ।। ११ ।।',
    'अनेन गणपतिमभिषिञ्चति ।',
    'स वाग्मी भवति ।',
    'चतुथ्र्यामनश्नन् जपति',
    'स विद्यावान् भवति ।',
    'इत्यथर्वणवाक्यम् ।',
    'ब्रह्माद्यावरणम् विद्यात् ।',
    'न बिभेति कदाचनेति ।। १२ ।।',
    'यो दूर्वाङ्कुरैर्यजति ।',
    'स वैश्रवणोपमो भवति ।',
    'यो लाजैर्यजति, स यशोवान् भवति ।',
    'स मेधावान् भवति ।',
    'यो मोदकसहस्रेण यजति ।',
    'स वाञ्छितफलमवाप्नोति ।',
    'यः साज्यसमिद्भिर्यजति',
    'स सर्वं लभते, स सर्वं लभते ।। १३ ।।',
    'अष्टौ ब्राह्मणान् सम्यग्ग्राहयित्वा,',
    'सूर्यवर्चस्वी भवति ।',
    'सूर्यग्रहे महानद्याम् प्रतिमासन्निधौ',
    'वा जप्त्वा, सिद्धमन्त्रो भवति ।',
    'महाविघ्नात् प्रमुच्यते ।',
    'महादोषात् प्रमुच्यते ।',
    'महापापात् प्रमुच्यते ।',
    'स सर्वविद् भवति, स सर्वविद् भवति ।',
    'य एवम् वेद ।। १४ ।।',
    'इत्युपनिषत् ।',
    '(शान्तिमन्त्राः)',
    'ॐ भद्रङ् कर्णेभिः शृणुयाम देवाः ।',
    'भद्रम् पश्येमाक्षभिर्यजत्राः । स्थिरैरङ्गैस्तुष्टुवांसस्तनूभिः',
    'व्यशेम देवहितं यदायुः ।।',
    'ॐ स्वस्ति न इन्द्रो वृद्धश्रवाः ।',
    'स्वस्ति नः पूषा विश्ववेदाः ।',
    'स्वस्ति नस्ताक्ष्र्योऽअरिष्टनेमिः',
    'स्वस्ति नो बृहस्पतिर्दधातु ।।',
    'ॐ सहनाववतु । सहनौ भुनक्तु ।',
    'सहवीर्यङ् करवावहै ।',
    'तेजस्विनावधीतमस्तु मा विद्विषावहै ।।',
    'ॐ शान्तिः शान्तिः शान्तिः ।।'];

var bds = ['श्रीगणेशाय नमः । नारद उवाच ।',
    'प्रणम्य शिरसा देवं गौरीपुत्रं विनायकम् ।',
    'भक्तावासं स्मरेन्नित्यं आयुःकामार्थसिद्धये ॥ १॥',
    'प्रथमं वक्रतुण्डं च एकदन्तं द्वितीयकम् ।',
    'तृतीयं कृष्णपिङ्गाक्षं गजवक्त्रं चतुर्थकम् ॥ २॥',
    'लम्बोदरं पञ्चमं च षष्ठं विकटमेव च ।',
    'सप्तमं विघ्नराजेन्द्रं धूम्रवर्णं तथाष्टमम् ॥ ३॥',
    'नवमं भालचन्द्रं च दशमं तु विनायकम् ।',
    'एकादशं गणपतिं द्वादशं तु गजाननम् ॥ ४॥',
    'द्वादशैतानि नामानि त्रिसंध्यं यः पठेन्नरः ।',
    'न च विघ्नभयं तस्य सर्वसिद्धिकरः प्रभुः ॥ ५॥',
    'विद्यार्थी लभते विद्यां धनार्थी लभते धनम् ।',
    'पुत्रार्थी लभते पुत्रान्मोक्षार्थी लभते गतिम् ॥ ६॥',
    'जपेद्गणपतिस्तोत्रं षड्भिर्मासैः फलं लभेत् ।',
    'संवत्सरेण सिद्धिं च लभते नात्र संशयः ॥ ७॥',
    'अष्टेभ्यो ब्राह्मणेभ्यश्च लिखित्वा यः समर्पयेत् ।',
    'तस्य विद्या भवेत्सर्वा गणेशस्य प्रसादतः ॥ ८॥','','॥ इति श्रीनारदपुराणे संकटनाशनं गणेशस्तोत्रं सम्पूर्णम् ॥'];

var cds = ['सुख करता दुखहर्ता वार्ता विघ्नची',
    'नूर्वी पूर्वी प्रेम कृपा जयाची',
    'सर्वांगी सुंदर उटीशेंदुराराची',
    'कंठी झळके माळ मुक्ताफळांची',
    '',
    'जय देव जय देव जय मंगल मूर्ती',
    'दर्शन मात्रे मन कामना पुरती',
    'जय देव जय देव ||',
    '',
    'रत्नखचित फरा तुझ गौरीकुमरा',
    'चंदनाची उटी कुमकुम केशरा',
    'हिरे जडीत मुकुट शोभतो बरा',
    'रुणझुणती नूपुरे चरणी घागरिया',
    'जय देव जय देव जय मंगल मूर्ती',
    'दर्शन मात्रे मन कामना पुरती',
    'जय देव जय देव ||',
    '',
    'लंबोदर पीतांबर फणिवर वंदना',
    'सरळ सोंड वक्रतुंड त्रिनयना',
    'दास रामाचा वाट पाहे सदना',
    'संकटी पावावे निर्वाणी रक्षावे सुरवर वंदना',
    '',
    'जय देव जय देव जय मंगल मूर्ती',
    'दर्शन मात्रे मन कामना पुरती',
    'जय देव जय देव ||'];


AppRegistry.registerComponent('bappa', () => bappa);
